---
kind: property
id: P:Autodesk.Revit.DB.DGNExportOptions.MergedViews
source: html/8fa912e0-6671-5970-f44e-39052e285575.htm
---
# Autodesk.Revit.DB.DGNExportOptions.MergedViews Property

Whether to merge all views in one file (via XRefs).
 Default value of mergedViews is false.

## Syntax (C#)
```csharp
public bool MergedViews { get; set; }
```